In [1]:
import numpy as np
import pandas as pd

In [2]:
df_tips=pd.read_csv("tips.csv")
df_tips

,total_bill,tip,sex,smoker,day,time,size,price_per_person,Payer Name,CC Number,Payment ID
0,16.99,1.01,Female,No,Sun,Dinner,2,8.49,Christy Cunningham,3560325168603410,Sun2959
1,10.34,1.66,Male,No,Sun,Dinner,3,3.45,Douglas Tucker,4478071379779230,Sun4608
2,21.01,3.50,Male,No,Sun,Dinner,3,7.00,Travis Walters,6011812112971322,Sun4458
3,23.68,3.31,Male,No,Sun,Dinner,2,11.84,Nathaniel Harris,4676137647685994,Sun5260
4,24.59,3.61,Female,No,Sun,Dinner,4,6.15,Tonya Carter,4832732618637221,Sun2251
...,...,...,...,...,...,...,...,...,...,...,...
239,29.03,5.92,Male,No,Sat,Dinner,3,9.68,Michael Avila,5296068606052842,Sat2657
240,27.18,2.00,Female,Yes,Sat,Dinner,2,13.59,Monica Sanders,3506806155565404,Sat1766
241,22.67,2.00,Male,Yes,Sat,Dinner,2,11.34,Keith Wong,6011891618747196,Sat3880
242,17.82,1.75,Male,No,Sat,Dinner,2,8.91,Dennis Dixon,4375220550950,Sat17
243,18.78,3.00,Female,No,Thur,Dinner,2,9.39,Michelle Hardin,3511451626698139,Thur672

1) df_tips içindeki Payment ID column'unun son 3 rakamını çekin. Bu işlemi 3 farklı yolla da yapmaya çalışın.

In [109]:
def last_three_digits(num):
    return str(num)[-3:]

df_tips['Payment ID'] = df_tips['Payment ID'].apply(last_three_digits)
df_tips["Payment ID"]

0      959
1      608
2      458
3      260
4      251
      ...
239    657
240    766
241    880
242    t17
243    672
Name: Payment ID, Length: 244, dtype: object

In [111]:
df_tips['Payment ID'] = df_tips['Payment ID'].apply(lambda x: str(x)[-3:])
df_tips['Payment ID']

0      959
1      608
2      458
3      260
4      251
      ...
239    657
240    766
241    880
242    t17
243    672
Name: Payment ID, Length: 244, dtype: object

In [112]:
df_tips['Payment ID'] = df_tips['Payment ID'].astype(str).str[-3:]
df_tips['Payment ID']

0      959
1      608
2      458
3      260
4      251
      ...
239    657
240    766
241    880
242    t17
243    672
Name: Payment ID, Length: 244, dtype: object

2) df_tips içindeki Payer Name sütununda isim ve soy isim bilgileri bulunuyor. O sütundan sadece isim bilgileri çekin ve 'JustName' adında yeni bir column oluşturun. (Bu biraz zorlayıcı olabilir, Önce kendiniz yapmaya çalışın fakat yapamazsanız ChatGPT'ye soruyu düzgünce sorarak cevabını kod olarak alabilirsiniz, ardından döndürülen kodu anlamaya çalışmanız yeterlidir.)

In [20]:
justName=pd.DataFrame(df_tips["Payer Name"].apply(lambda x: x.split()[0]))
justName

    Payer Name
0      Christy
1      Douglas
2       Travis
3    Nathaniel
4        Tonya
..         ...
239    Michael
240     Monica
241      Keith
242     Dennis
243   Michelle

[244 rows x 1 columns]

In [21]:
justName.rename(columns={"Payer Name" : "Just Name"}, inplace=True)

In [22]:
justName

     Just Name
0      Christy
1      Douglas
2       Travis
3    Nathaniel
4        Tonya
..         ...
239    Michael
240     Monica
241      Keith
242     Dennis
243   Michelle

[244 rows x 1 columns]

3) 2.Soruda yeni oluşturduğunuz 'JustName' sütunundaki verilerin her birinden kaç tane olduğuna uygun methodu kullanarak bakın.

In [23]:
justName.value_counts()

Just Name
Jason          9
Michael        7
James          6
David          6
Christopher    5
              ..
Heather        1
Grant          1
Gordon         1
Glenn          1
Kelly          1
Length: 153, dtype: int64

4) 3.Soruda gördüğünüz gibi JustName sütununda 'Jason' isminden 9 tane, 'Michael' isminden 7 tane , 'James' isminden 6 tane bulunuyor. Peki bunların hepsi gerçekten farklı kişiler mi ? Hemen 'Payer Name' sütunundaki verilerin adetlerini de saydırtarak bir kıyaslama yapın. 'JustName' sütununu kullanmanın faydasız ve yanıltıcı olabileceğini görün ardından oluşturduğumuz 'JustName' sütununu kalıcı olarak drop edin. (Oluşturmanız için bir pratikti bu sütun sadece :D)

In [24]:
df_tips["Payer Name"].value_counts()

Jason          9
Michael        7
James          6
David          6
Christopher    5
              ..
Shawna         1
Louis          1
Chris          1
Mark           1
Michelle       1
Name: Payer Name, Length: 153, dtype: int64

In [25]:
justName.drop("Just Name", axis=1 , inplace=True)

In [26]:
justName

Empty DataFrame
Columns: []
Index: [0, 1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15, 16, 17, 18, 19, 20, 21, 22, 23, 24, 25, 26, 27, 28, 29, 30, 31, 32, 33, 34, 35, 36, 37, 38, 39, 40, 41, 42, 43, 44, 45, 46, 47, 48, 49, 50, 51, 52, 53, 54, 55, 56, 57, 58, 59, 60, 61, 62, 63, 64, 65, 66, 67, 68, 69, 70, 71, 72, 73, 74, 75, 76, 77, 78, 79, 80, 81, 82, 83, 84, 85, 86, 87, 88, 89, 90, 91, 92, 93, 94, 95, 96, 97, 98, 99, ...]

[244 rows x 0 columns]

5) Erkeklerin ve kadınların davranış patternlerini ayrı ayrı inceleyip yorumda bulunabilmek için 'df_male' ve 'df_female' adında 2 dataframe oluşturun. Birinde sadece 157 erkek verisi, diğerinde sadece 87 kadın verisi bulunsun.

In [28]:
df_male=df_tips[df_tips["sex"]=="Male"].sample(n=157,random_state=42)
df_female=df_tips[df_tips["sex"]=="Female"].sample(n=82,random_state=42)

In [29]:
df_male

,total_bill,tip,sex,smoker,day,time,size,price_per_person,Payer Name,CC Number,Payment ID
194,16.58,4.00,Male,Yes,Thur,Lunch,2,8.29,Benjamin,676210011505,Thur9318
60,20.29,3.21,Male,Yes,Sat,Dinner,2,10.14,Anthony,347614304015027,Sat2353
207,38.73,3.00,Male,Yes,Sat,Dinner,4,9.68,Ricky,347817964484033,Sat4505
216,28.15,3.00,Male,Yes,Sat,Dinner,5,5.63,Shawn,4590982568244,Sat7320
175,32.90,3.11,Male,Yes,Sun,Dinner,2,16.45,Nathan,370307040837149,Sun5109
...,...,...,...,...,...,...,...,...,...,...,...
97,12.03,1.50,Male,Yes,Fri,Dinner,2,6.02,Eric,580116092652,Fri9268
170,50.81,10.00,Male,Yes,Sat,Dinner,3,16.94,Gregory,5473850968388236,Sat1954
20,17.92,4.08,Male,No,Sat,Dinner,2,8.96,Thomas,4403296224639756,Sat1709
149,7.51,2.00,Male,No,Thur,Lunch,2,3.76,Daniel,4823139288341889,Thur6321
163,13.81,2.00,Male,No,Sun,Dinner,2,6.90,Charles,5552793481414044,Sun8594

In [30]:
df_female

,total_bill,tip,sex,smoker,day,time,size,price_per_person,Payer Name,CC Number,Payment ID
214,28.17,6.50,Female,Yes,Sat,Dinner,3,9.39,Marissa,4922302538691962,Sat3374
0,16.99,1.01,Female,No,Sun,Dinner,2,8.49,Christy,3560325168603410,Sun2959
100,11.35,2.50,Female,Yes,Fri,Dinner,2,5.68,Lori,38558279384492,Fri4106
85,34.83,5.17,Female,No,Thur,Lunch,4,8.71,Shawna,6011787464177340,Thur7972
51,10.29,2.60,Female,No,Sun,Dinner,2,5.14,Jessica,4999759463713,Sun4474
...,...,...,...,...,...,...,...,...,...,...,...
82,10.07,1.83,Female,No,Thur,Lunch,1,10.07,Julie,630413282843,Thur4909
11,35.26,5.00,Female,No,Sun,Dinner,4,8.82,Diane,4577817359320969,Sun6686
92,5.75,1.00,Female,Yes,Fri,Dinner,2,2.88,Leah,3508911676966392,Fri3780
225,16.27,2.50,Female,Yes,Fri,Lunch,2,8.14,Whitney,3579111947217428,Fri6665
209,12.76,2.23,Female,Yes,Sat,Dinner,2,6.38,Sarah,341876516331163,Sat1274

6) Ardından bu 'df_male' ile 'df_female' 'in ödedikleri bahşişler toplamını bulup karşılaştırın

In [37]:
male_total_tip=df_male["tip"].sum()
male_total_tip

485.07

In [39]:
female_total_tip=df_female["tip"].sum()
female_total_tip

235.31

In [40]:
male_total_tip-female_total_tip

249.76

7) 6.Soruda erkeklerin ve kadınların ödedikleri bahşişler toplamına bakıldığında Erkeklerin kadınlara kıyasla toplamda daha çok bahşiş ödediğini görüyoruz. Fakat biz biliyoruz ki bizim verimizde 157 Erkek, 87 kadın verisi vardı. Dolayısıyla Erkek sayısı daha fazla olduğu için toplam ödeyecekleri bahşiş miktarlarında da daha fazla çıkması oldukça normal bir durum. Bu yüzden daha mantıklı bir çıkarım için bu sefer df_male ile df_female'in bahşiş ORTALAMALARIN'a bakıp kıyaslayın, aralarında anlamlı ve ciddi bir fark var mı ?

In [42]:
male_tip_mean=df_male["tip"].mean()
male_tip_mean

3.0896178343949043

In [43]:
female_tip_mean=df_female["tip"].mean()
female_tip_mean

2.8696341463414634

# Aralarında çok ciddi bir fark bulunmamakta

8) Oluşturmuş olduğunuz df_male ile çalışarak elimizdeki verideki erkeklerin yüzde kaçının sigara içtiğini bulun. Aynı şekilde elimizdeki kadınların yüzde kaçının sigara içtiğini de bulun. Aralarında anlamlı bir fark mı yorumlayın.

# erkeklerin ortalaması

In [51]:
df_male

,total_bill,tip,sex,smoker,day,time,size,price_per_person,Payer Name,CC Number,Payment ID
194,16.58,4.00,Male,Yes,Thur,Lunch,2,8.29,Benjamin,676210011505,Thur9318
60,20.29,3.21,Male,Yes,Sat,Dinner,2,10.14,Anthony,347614304015027,Sat2353
207,38.73,3.00,Male,Yes,Sat,Dinner,4,9.68,Ricky,347817964484033,Sat4505
216,28.15,3.00,Male,Yes,Sat,Dinner,5,5.63,Shawn,4590982568244,Sat7320
175,32.90,3.11,Male,Yes,Sun,Dinner,2,16.45,Nathan,370307040837149,Sun5109
...,...,...,...,...,...,...,...,...,...,...,...
97,12.03,1.50,Male,Yes,Fri,Dinner,2,6.02,Eric,580116092652,Fri9268
170,50.81,10.00,Male,Yes,Sat,Dinner,3,16.94,Gregory,5473850968388236,Sat1954
20,17.92,4.08,Male,No,Sat,Dinner,2,8.96,Thomas,4403296224639756,Sat1709
149,7.51,2.00,Male,No,Thur,Lunch,2,3.76,Daniel,4823139288341889,Thur6321
163,13.81,2.00,Male,No,Sun,Dinner,2,6.90,Charles,5552793481414044,Sun8594

In [59]:
smoking_males=len(df_male[df_male["smoker"]=="Yes"])
smoking_males

60

In [56]:
total_males=len(df_male)
total_males

157

In [61]:
smoking_percentage_male=(smoking_males/total_males)*100
smoking_percentage_male

38.21656050955414

# kadınların ortalaması

In [63]:
df_male

,total_bill,tip,sex,smoker,day,time,size,price_per_person,Payer Name,CC Number,Payment ID
194,16.58,4.00,Male,Yes,Thur,Lunch,2,8.29,Benjamin,676210011505,Thur9318
60,20.29,3.21,Male,Yes,Sat,Dinner,2,10.14,Anthony,347614304015027,Sat2353
207,38.73,3.00,Male,Yes,Sat,Dinner,4,9.68,Ricky,347817964484033,Sat4505
216,28.15,3.00,Male,Yes,Sat,Dinner,5,5.63,Shawn,4590982568244,Sat7320
175,32.90,3.11,Male,Yes,Sun,Dinner,2,16.45,Nathan,370307040837149,Sun5109
...,...,...,...,...,...,...,...,...,...,...,...
97,12.03,1.50,Male,Yes,Fri,Dinner,2,6.02,Eric,580116092652,Fri9268
170,50.81,10.00,Male,Yes,Sat,Dinner,3,16.94,Gregory,5473850968388236,Sat1954
20,17.92,4.08,Male,No,Sat,Dinner,2,8.96,Thomas,4403296224639756,Sat1709
149,7.51,2.00,Male,No,Thur,Lunch,2,3.76,Daniel,4823139288341889,Thur6321
163,13.81,2.00,Male,No,Sun,Dinner,2,6.90,Charles,5552793481414044,Sun8594

In [67]:
smoking_females=len(df_female[df_female["smoker"]=="Yes"])
smoking_females

32

In [68]:
total_female=len(df_female)
total_female

82

In [71]:
smoking_percentage_female=(smoking_females/total_female)*100
smoking_percentage_female

39.02439024390244

# Aralarında ciddi bir fark bulunmamakta

9) Erkeklerin zaman olarak dinnerda mı yoksa lunch'da mı daha fazla yemek yediğini yüzdesel olarak bulun. Aynı işlemi kadınlar için de yapın. Yüzdesel olarak erkeklerin ve kadınların yemek yeme vakitleri arasında anlamlı bir fark var mı yok mu yorumlayın.

In [100]:
df_male["time"].value_counts()

Dinner    124
Lunch      33
Name: time, dtype: int64

In [105]:
male_dinner_count=124
male_lunc_count=33

percentage_male_dinner_time=(male_dinner_count*100)/157
print("male dinner percentage : {}".format(percentage_male_dinner_time))


percentage_male_lunch_time=(male_lunc_count*100)/157
print("male lunch percentage : {}".format(percentage_male_lunch_time))

male dinner percentage : 78.98089171974522
male lunch percentage : 21.019108280254777

In [101]:
df_female["time"].value_counts()

Dinner    49
Lunch     33
Name: time, dtype: int64

In [106]:
female_dinner_count=49
female_lunc_count=33

percentage_female_dinner_time=(female_dinner_count*100)/82
print("male dinner percentage : {}".format(percentage_female_dinner_time))


percentage_female_lunch_time=(female_lunc_count*100)/82
print("male lunch percentage : {}".format(percentage_female_lunch_time))

male dinner percentage : 59.75609756097561
male lunch percentage : 40.24390243902439

akşam saatlerinde yemek

10) CC Number sütununu kalıcı olarak drop edin. Ardından df'in içindeki sütunların birbirleriyle olan ilişkilerini inceleyin ve çıkan sonuçlar hakkında yorumlarınızı belirtin.

In [73]:
df_tips.drop("CC Number", axis=1, inplace=True)
df_tips

,total_bill,tip,sex,smoker,day,time,size,price_per_person,Payer Name,Payment ID
0,16.99,1.01,Female,No,Sun,Dinner,2,8.49,Christy,Sun2959
1,10.34,1.66,Male,No,Sun,Dinner,3,3.45,Douglas,Sun4608
2,21.01,3.50,Male,No,Sun,Dinner,3,7.00,Travis,Sun4458
3,23.68,3.31,Male,No,Sun,Dinner,2,11.84,Nathaniel,Sun5260
4,24.59,3.61,Female,No,Sun,Dinner,4,6.15,Tonya,Sun2251
...,...,...,...,...,...,...,...,...,...,...
239,29.03,5.92,Male,No,Sat,Dinner,3,9.68,Michael,Sat2657
240,27.18,2.00,Female,Yes,Sat,Dinner,2,13.59,Monica,Sat1766
241,22.67,2.00,Male,Yes,Sat,Dinner,2,11.34,Keith,Sat3880
242,17.82,1.75,Male,No,Sat,Dinner,2,8.91,Dennis,Sat17
243,18.78,3.00,Female,No,Thur,Dinner,2,9.39,Michelle,Thur672

In [82]:
#sigara içenlerin ortalama bahşiş oranı
smoker_yes_tip=df_tips[df_tips["smoker"]=="Yes"]["tip"]
smoker_yes_tip.mean()

3.008709677419355

In [81]:
#sigara içmeyenlerin  ortalama bahşiş oranı
smoker_no_tip=df_tips[df_tips["smoker"]=="No"]["tip"]
smoker_no_tip.mean()

2.9918543046357615

In [90]:
#sigara içenlerin  hesap ortalaması 
smoker_yes_bill=df_tips[df_tips["smoker"]=="Yes"]["total_bill"].mean()
smoker_yes_bill

20.756344086021507

In [91]:
#sigara içmeyenlerin  hesap ortalaması 
smoker_No_bill=df_tips[df_tips["smoker"]=="No"]["total_bill"].mean()
smoker_No_bill

19.18827814569536

Buradan ödenen hesapları ve verilen bahşiş oranlarını kontrol edebiliriz. Diğer veirlen içinde bu şekilde bir karşılaştırma yapabiliriz.